
CONSONANTS = { 
    "k"  : "ก" ,
    "kh" : "ค" ,"kh-" : "ข" ,
    "ng" : "ง" ,"ng-" : "หง" ,
    "c"  : "จ" ,
    "ch" : "ช" ,"ch-" : "ฉ" ,
    "s"  : "ซ" ,"s-" : "ส",
    "j"  : "ย" ,"j--"  : "หย" ,"j-"  : "หย" ,
    "d"  : "ด" ,
    "t"  : "ต" ,
    "th" : "ท" ,"th-" : "ถ" ,
    "n"  : "น" ,"n--"  : "หน" , "n-"  : "หน" ,
    "b"  : "บ" ,
    "p"  : "ป" ,
    "ph" : "พ" ,"ph-" : "ผ" ,
    "r"  : "ร" ,"r--"  : "หร" ,"r-"  : "หร" ,
    "l"  : "ล" ,"l--"  : "หล" ,"l-"  : "หล" ,
    "w"  : "ว" ,"w--"  : "หว" ,"w-"  : "หว" ,
    "h"  : "ฮ" ,"h-"  : "ห" ,
    "f"  : "ฟ" ,"f-"  : "ฝ" ,
    "m"  : "ม" ,"m--"  : "หม" ,"m-"  : "หม" ,
    "z"  : "อ" ,
    ""   : ""
}

CLUSTERS = { 
    "kr"  : "กร",
    "kl"  : "กล",
    "kw"  : "กว",
    "khr" : "คร","khr-" : "ขร",
    "khl" : "คล","khl-" : "ขล",
    "khw" : "คว","khw-" : "ขว",
    "pr"  : "ปร",
    "pl"  : "ปล",
    "phr" : "พร",
    "phl" : "พล",
    "tr"  : "ตร",
    "thr" : "ทร",
    "br"  : "บร",
    "bl"  : "บล",
    "fr"  : "ฟร",
    "fl"  : "ฟล",
    "dr"  : "ดร",
    ""   : ""
}

VOWELS_SHORT = { 
    "i" : "อิ",
    "v" : "อึ",
    "u" : "อุ",
    "e" : "เอะ",
    "q" : "เออะ",
    "o" : "โอะ",
    "x" : "แอะ",
    "a" : "อะ",
    "@" : "เอาะ",
}

VOWELS_LONG = {
    "ii" : "อี",
    "vv" : "อื",
    "uu" : "อู",
    "ee" : "เอ",
    "qq" : "เออ",
    "oo" : "โอ",
    "xx" : "แอ",
    "aa" : "อา",
    "@@" : "ออ",
    # move special
    "ia"  : "เอียะ" ,
    "iia" : "เอีย" ,
    "va"  : "เอือะ" ,
    "vva" : "เอือ" ,
    "ua"  : "อัวะ" ,
    "uua" : "อัว" ,
#     "aw"  : "เอา",
}

DIPTHONGS = { 
    "ia"  : "เอียะ" ,
    "iia" : "เอีย" ,
    "va"  : "เอือะ" ,
    "vva" : "เอือ" ,
    "ua"  : "อัวะ" ,
    "uua" : "อัว" ,
}

CODAS = { 
    "k^"  : "ก" ,
    "kh^" : "ค" ,
    "ng^" : "ง" ,
    "c^"  : "จ" ,
    "ch^" : "ช" ,
    "s^"  : "ซ" ,
    "j^"  : "ย" ,
    "d^"  : "ด" ,
    "t^"  : "ด" ,
    "th^" : "ท" ,
    "n^"  : "น" , 
    "b^"  : "บ" ,
#     "p"  : "ป" ,
    "p^"  : "บ" ,
    "ph^" : "พ" ,
    "r^"  : "ร" ,
    "l^"  : "ล" ,
    "w^"  : "ว" ,
    "h^"  : "" ,
    "f^"  : "ฟ" ,
    "m^"  : "ม" ,
    "z^"  : "" ,
    ""   : ""
}
