vowels_short = { 
    "i" : "อิ",
    "v" : "อึ",
    "u" : "อุ",
    "e" : "เอะ",
    "q" : "เออะ",
    "o" : "โอะ",
    "x" : "แอะ",
    "a" : "อะ",
    "@" : "เอาะ",
}

vowels_long = {
    "ii" : "อี",
    "vv" : "อื",
    "uu" : "อู",
    "ee" : "เอ",
    "qq" : "เออ",
    "oo" : "โอ",
    "xx" : "แอ",
    "aa" : "อา",
    "@@" : "ออ",
    # move special
    "ia"  : "เอียะ" ,
    "va"  : "เอือะ" ,
    "ua"  : "อัวะ" ,
    "aw"  : "เอา",
}

dipthongs = { 
    "ia"  : "เอียะ" ,
    "iia" : "เอีย" ,
    "va"  : "เอือะ" ,
    "vva" : "เอือ" ,
    "ua"  : "อัวะ" ,
    "uua" : "อัว" ,
}

vowels_all = { 
    "i" : "อิ",
    "v" : "อึ",
    "u" : "อุ",
    "e" : "เอะ",
    "q" : "เออะ",
    "o" : "โอะ",
    "x" : "แอะ",
    "a" : "อะ",
    "@" : "เอาะ",
    "ii" : "อี",
    "vv" : "อื",
    "uu" : "อู",
    "ee" : "เอ",
    "qq" : "เออ",
    "oo" : "โอ",
    "xx" : "แอ",
    "aa" : "อา",
    "@@" : "ออ",
    # move special
    "ia"  : "เอียะ" ,
    "va"  : "เอือะ" ,
    "ua"  : "อัวะ" ,
#     "aw"  : "เอา",
    "ia"  : "เอียะ" ,
    "iia" : "เอีย" ,
    "va"  : "เอือะ" ,
    "vva" : "เอือ" ,
    "ua"  : "อัวะ" ,
    "uua" : "อัว" ,
}

#################################################
live = {
    'ng^': 'ง',
    'n^': 'น',
    'm^': 'ม',
    'j^': 'ย',
    'w^': 'ว',
    'l^': 'ล',
} 

dead = {
    'k^': 'ก',
    'c^': 'จ' ,
    'd^': 'ด',
    't^': 'ต',
    'b^': 'บ',
    'p^': 'ป',
    's^': 'ส',
    'f^': 'ฟ',
    'ch^': "ช"
}

low = { 
    "kh" : "ค" ,
    "ch" : "ช" ,
    "th" : "ท" ,
    "ph" : "พ" ,
    "s"  : "ซ" ,
    "f"  : "ฟ" ,
    "h"  : "ฮ" ,

    "ng" : "ง" ,
    "n"  : "น" ,
    "m"  : "ม" ,
    "r"  : "ร" ,
    "l"  : "ล" ,
    "w"  : "ว" ,
    "j"  : "ย" ,

    "khr" : "คร",
    "khl" : "คล",
    "khw" : "คว",
    "phr" : "พร",
    "phl" : "พล",
    "thr" : "ทร",
    "fl"  : "ฟล",
    "fr"  : "ฟร",
}
low_single = {
    "ng" : "ง" ,
    "n"  : "น" ,
    "m"  : "ม" ,
    "r"  : "ร" ,
    "l"  : "ล" ,
    "w"  : "ว" ,
    "j"  : "ย" ,
}
low_pair = {
    "kh" : "ค" ,
    "ch" : "ช" ,
    "th" : "ท" ,
    "ph" : "พ" ,
    "s"  : "ซ" ,
    "f"  : "ฟ" ,
    "h"  : "ฮ" ,

    "khr" : "คร",
    "khl" : "คล",
    "khw" : "คว",
    "phr" : "พร",
    "phl" : "พล",
    "thr" : "ทร",
    "fl"  : "ฟล",
    "fr"  : "ฟร",
}


mid = {
    "k"  : "ก" ,
    "c"  : "จ" ,
    "d"  : "ด" ,
    "t"  : "ต" ,
    "b"  : "บ" ,
    "p"  : "ป" ,
    "z"  : "อ" ,
    "kr"  : "กร",
    "kl"  : "กล",
    "kw"  : "กว",
    "pr"  : "ปร",
    "pl"  : "ปล",
    "tr"  : "ตร",
    "br"  : "บร",
    "bl"  : "บล",
    "dr"  : "ดร",
}

high = {
    "kh" : "ข" ,
    "ch" : "ฉ" ,
    "th" : "ถ" ,
    "ph" : "ผ" ,
    "f"  : "ฝ" ,
    "s"  : "ส" ,
    "h"  : "ห" ,
    
    "khr" : "ขร" ,
    "khl" : "ขล" ,
    "khw" : "ขว",


    "phr" : "ผร",
    "phl" : "ผล",
    "thr" : "ถร",
    "fl"  : "ฝล",
    "fr"  : "ฝร",

    "n"  : "น" ,
    "ng" : "ง" ,
    "m"  : "ม" ,
    "j"  : "ย" ,
    "r"  : "ร" ,
    "l"  : "ล" ,

    "w-"  : "หว" ,
    "n-"  : "หน" ,
    "ng-" : "หง" ,
    "m-"  : "หม" ,
    "j-"  : "หย" ,
    "r-"  : "หร" ,
    "l-"  : "หล" ,

}
